# Data Cleaning

### Handling Missing Values

In [1]:
import pandas as pd
import numpy as np

In [2]:
q = np.nan # nan or NaN is Not a Number or simply null value

In [3]:
pd.isnull(q)

True

In [4]:
pd.isna(q) # pd.isna() is same as pd.isnull()

True

***Note: pd.isnull(q) and pd.notnull(q) checks whether the data q is Null or not.***

In [5]:
pd.isnull(pd.Series([1, 2, 3, np.nan, 4, np.nan]))

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [6]:
pd.isnull(pd.DataFrame({
    'Column 1': [1, 2, 3, np.nan, 4, np.nan], 
    'Column 2': [np.nan, 2, 3, np.nan, 4, 1],
    'Column 3': [np.nan, np.nan, 3, np.nan, 4, np.nan],
}))

   Column 1  Column 2  Column 3
0     False      True      True
1     False     False      True
2     False     False     False
3      True      True      True
4     False     False     False
5      True     False      True

In [7]:
pd.DataFrame({
    'Column 1': [1, 2, 3, np.nan, 4, np.nan], 
    'Column 2': [np.nan, 2, 3, np.nan, 4, 1],
    'Column 3': [np.nan, np.nan, 3, np.nan, 4, np.nan],
}).count()

Column 1    4
Column 2    4
Column 3    2
dtype: int64

In [8]:
pd.DataFrame({
    'Column 1': [1, 2, 3, np.nan, 4, np.nan], 
    'Column 2': [np.nan, 2, 3, np.nan, 4, 1],
    'Column 3': [np.nan, np.nan, 3, np.nan, 4, np.nan],
}).sum()

Column 1    10.0
Column 2    10.0
Column 3     7.0
dtype: float64

In [9]:
s = pd.Series([1, 2, 3, np.nan, 4, np.nan])

In [10]:
s.isnull()

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [11]:
pd.notnull(s).count()

6

In [12]:
pd.notnull(s).sum()

4

In [13]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
4    4.0
dtype: float64

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

### dropping null values in series

In [14]:
s.dropna()

0    1.0
1    2.0
2    3.0
4    4.0
dtype: float64

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

### Dropping null values in Dataframe

In [15]:
df = pd.DataFrame({
    'Column 1': [1, 2, 3, np.nan, 4, np.nan], 
    'Column 2': [np.nan, 2, 3, np.nan, 4, 1],
    'Column 3': [np.nan, np.nan, 3, np.nan, 4, np.nan],
})

In [16]:
df

   Column 1  Column 2  Column 3
0       1.0       NaN       NaN
1       2.0       2.0       NaN
2       3.0       3.0       3.0
3       NaN       NaN       NaN
4       4.0       4.0       4.0
5       NaN       1.0       NaN

In [17]:
df.isnull()

   Column 1  Column 2  Column 3
0     False      True      True
1     False     False      True
2     False     False     False
3      True      True      True
4     False     False     False
5      True     False      True

In [18]:
df.isnull().count()

Column 1    6
Column 2    6
Column 3    6
dtype: int64

In [19]:
df.isnull().sum()

Column 1    2
Column 2    2
Column 3    4
dtype: int64

***We can also do df.dropna() like in Series. But in DataFrame the row with at least one NaN will be dropped. Example is shown below:***

In [20]:
df.dropna()

   Column 1  Column 2  Column 3
2       3.0       3.0       3.0
4       4.0       4.0       4.0

In [21]:
new_column = pd.Series([5, 6, 7, 8, 10, 20], name='Column 4')
df['Column 4'] = new_column
df

   Column 1  Column 2  Column 3  Column 4
0       1.0       NaN       NaN         5
1       2.0       2.0       NaN         6
2       3.0       3.0       3.0         7
3       NaN       NaN       NaN         8
4       4.0       4.0       4.0        10
5       NaN       1.0       NaN        20

***By specifying the axis in the dropna() method, we eliminate the column with NaN value***

In [22]:
df.dropna(axis="columns")

   Column 4
0         5
1         6
2         7
3         8
4        10
5        20

# Cleaning the NOT NULL values

In [23]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'X', '?'], 
    'Age': [31, 21, 24, 59, 1900],
})
df

  Sex   Age
0   M    31
1   F    21
2   F    24
3   X    59
4   ?  1900

Here in this example, in the sex column the values should be M for male and F for Female. But there are D and ? and Age is 1999 which are invalid so we must fix that.

In [24]:
df['Sex'].unique()

array(['M', 'F', 'X', '?'], dtype=object)

In [25]:
df['Sex'] = df['Sex'].replace({'X': 'M', '?': 'F'})

In [26]:
df

  Sex   Age
0   M    31
1   F    21
2   F    24
3   M    59
4   F  1900

In [27]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 100

In [28]:
df

  Sex  Age
0   M   31
1   F   21
2   F   24
3   M   59
4   F   19

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

### Cleaning Duplicates in Series

In [29]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
], index=[
    'Gérard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth '
])
ambassadors

Gérard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [30]:
ambassadors.duplicated()

Gérard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [31]:
ambassadors.duplicated(keep='last')

Gérard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [38]:
ambassadors.duplicated(keep=False) # keep=False considers all the repetition as duplicates

Gérard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [35]:
ambassadors.drop_duplicates()

Gérard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [36]:
ambassadors.drop_duplicates(keep='last')

Gérard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [37]:
ambassadors.drop_duplicates(keep=False)

Gérard Araud          France
Armando Varricchio     Italy
dtype: object

![purple-divider](https://user-images.githubusercontent.com/7065401/52071927-c1cd7100-2562-11e9-908a-dde91ba14e59.png)

### Cleaning Duplicates in Dataframe

In [39]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'LeBron James',
        'Kobe Bryant',
        'Carmelo Anthony',
        'Kobe Bryant',
    ],
    'Pos': [
        'SG',
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [40]:
players

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [41]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [42]:
players.duplicated(subset=['Name'])

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [43]:
players.duplicated(subset=['Name'], keep='last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [44]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     LeBron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF